# MoveElements Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementTransformUtils..::..MoveElements Method
ElementTransformUtils Class See Also
---
Moves a set of elements by a given transformation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static void MoveElements(
	Document document,
	ICollection<ElementId> elementsToMove,
	XYZ translation
)
```

Visual Basic
---
```text
Public Shared Sub MoveElements ( _
	document As Document, _
	elementsToMove As ICollection(Of ElementId), _
	translation As XYZ _
)
```

Visual C++
---
```text
public:
static void MoveElements(
	Document^ document,
	ICollection<ElementId^>^ elementsToMove,
	XYZ^ translation
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document that owns the elements.
elementsToMove
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> The set of elements to move.
translation
    Type: Autodesk.Revit.DB..::..XYZ The translation vector for the elements.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given element id set is empty. -or- One or more elements in elementsToMove do not exist in the document. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | If we are not able to move all the elements (for example, if one or more elements is pinned). -or- Move operation failed. |

# See Also
ElementTransformUtils Class
Autodesk.Revit.DB Namespace